Repository: Th0masL/swpm-mailjet-integration
Catalog: languages/swpm-mailjet-integration-*.po
Languages: fr_fr

source: I want to subscribe to the Newsletter
fr_fr: Je veux m'abonner à la Newsletter

source: Mailjet Integration Addon Settings
fr_fr: Réglages de l'extension Mailjet Integration

source: Read the
fr_fr: Lisez le

source: usage documentation
fr_fr: manuel d'utilisation

source: to learn how to use the Mailjet Integration addon.
fr_fr: pour savoir comment utiliser l'extension Mailjet Integration.

source: Enable Mailjet Integration
fr_fr: Activer Mailjet Integration

source: This add-on requires the
fr_fr: Cette extension requiert que le

source: Official Mailjet plugin
fr_fr: Plugin Officiel Mailjet

source: to be installed and active.
fr_fr: soit installé et activé.

source: Enabling this option will add an extra field on the Registration and on the Profile Edit forms.
fr_fr: Activez cette option pour ajouter un champ supplémentaire sur le formulaire d'Enregistrement et sur le formulaire d'Édition du Profil.

source: This extra field will allow the
fr_fr: Ce champ supplémentaire permettra au

source: to automatically subscribe/update the newsletter preferences of the SWPM user on the Mailjet Website.
fr_fr: d'ajouter et de mettre automatiquement à jour les préférences de Newsletter pour l'utilisateur SWPM sur le site Mailjet.

source: Enable this option to be able to edit the other settings below.
fr_fr: Activez cette option afin de pouvoir accéder aux autres réglages ci-dessous.

source: Subscription Mode
fr_fr: Méthode d'Abonnement

source: Invisible and Checked (Force Subscription)
fr_fr: Invisible et Cochée (Force l'Inscription)

source: Visible and Checked
fr_fr: Visible et Cochée

source: Visible but Not Checked
fr_fr: Visible mais Non Cochée

source: Select the Subscription Mode on the Registration Form. Default is 'Visible but Not Checked', meaning that the user will have to check the Newsletter checkbox on the Registration Form if he wants to subscribe.
fr_fr: Selectionnez le type d'Inscription pour le formulaire d'Enregistrement. Par default, la checkbox sera 'Visible mais Non Cochée', ce qui veut dire que l'utilisateur devra cliquer si il souhaite s'abonner.
